app/controllers/games_controller.rb

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
       @game = Game.find(params[:id])

SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "subgenres".* FROM "subgenres" WHERE "subgenres"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def submit
        @score = 0
        @game= Game.find(params[:id])

        for i in 0..(showQuestions @game.subgenre_id).length-1